from hw_class_Room import Room

room_hallway = Room('Прихожая', 3, 1, 3)
'''Экземпляр от класса Room '''

print('Метод 2 и Метод 3  __str__ и __repr__ подхватывают друг друга:', room_hallway)



new_lenght = room_hallway + 7
'''
Метод 4 __add__Отвечает за операцию '+'
Предположим после перепланировки параметр lenght (длина) увеличится.
'''
print('Метод 4. Новая длина комнаты:', new_lenght, 'метров.')



new_lenght_on_right = 100 + room_hallway
'''
Метод 5 __radd__Как и метод __add__ отвечает за сложение,
но в случаях, когда главный объект находится СПРАВА
'''
print('Метод 5. New_lenght_on_right объект находится СПРАВА =', new_lenght_on_right)


room_wardrobe = Room('Гардероб', 2, 2, 3) # Создал экземпляр класса гардероб
'''
Метод 6 __eq__Отвечает за сравнение чисел.
В моем примере, метод сравнивает длину и ширину двух помещений (площадь)
и выдает:
True-> если величины равны
False-> если величины отличаются
'''
print('Метод 6. Сравниваем lenght & width.Если длина и ширина\
    помещений одинаковая результат True: ', room_hallway == room_wardrobe)



print('Метод 7. Если параметры одного помещения (длина, ширина, высота) >0 будет True: ',bool(room_hallway))
'''
Метод 7  __bool__
Если хотя бы один параметр в габаритах комнаты 
будет равен ноль (помещение не реальное), метод выведет False
'''

